amd/deployment/vllm/serving_benchmarks_vllm_10000.txt

python benchmark_serving.py --backend vllm --model meta-llama/Llama-3.1-405B-Instruct --dataset-name book --dataset-path="book.txt" --book-input-len 10000 -num-prompt=1  # set 1,2,4,...,64

============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  20.85     
Total input tokens:                      10000     
Total generated tokens:                  122       
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         5.85      
Total Token throughput (tok/s):          485.58    
---------------Time to First Token----------------
Mean TTFT (ms):                          12286.18  
Median TTFT (ms):                        12286.18  
P99 TTFT (ms):                           12286.18  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          70.72     
Median TPOT (ms):                        70.72     
P99 TPOT (ms):                           70.72     
---------------Inter-token Latency----------------
Mean ITL (ms):                           70.05     
Median ITL (ms):                         66.38     
P99 ITL (ms):                            135.38    
==================================================

============ Serving Benchmark Result ============
Successful requests:                     2         
Benchmark duration (s):                  32.74     
Total input tokens:                      20000     
Total generated tokens:                  240       
Request throughput (req/s):              0.06      
Output token throughput (tok/s):         7.33      
Total Token throughput (tok/s):          618.16    
---------------Time to First Token----------------
Mean TTFT (ms):                          18380.39  
Median TTFT (ms):                        18380.39  
P99 TTFT (ms):                           24347.43  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          115.44    
Median TPOT (ms):                        115.44    
P99 TPOT (ms):                           159.29    
---------------Inter-token Latency----------------
Mean ITL (ms):                           115.62    
Median ITL (ms):                         68.06     
P99 ITL (ms):                            735.56    
==================================================

============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  57.08     
Total input tokens:                      40000     
Total generated tokens:                  472       
Request throughput (req/s):              0.07      
Output token throughput (tok/s):         8.27      
Total Token throughput (tok/s):          708.98    
---------------Time to First Token----------------
Mean TTFT (ms):                          30569.56  
Median TTFT (ms):                        30592.80  
P99 TTFT (ms):                           48443.75  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          211.95    
Median TPOT (ms):                        204.20    
P99 TPOT (ms):                           365.11    
---------------Inter-token Latency----------------
Mean ITL (ms):                           208.55    
Median ITL (ms):                         69.64     
P99 ITL (ms):                            802.75    
==================================================

============ Serving Benchmark Result ============
Successful requests:                     8         
Benchmark duration (s):                  108.42    
Total input tokens:                      80000     
Total generated tokens:                  998       
Request throughput (req/s):              0.07      
Output token throughput (tok/s):         9.20      
Total Token throughput (tok/s):          747.08    
---------------Time to First Token----------------
Mean TTFT (ms):                          55713.23  
Median TTFT (ms):                        55457.44  
P99 TTFT (ms):                           98729.96  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          379.62    
Median TPOT (ms):                        390.73    
P99 TPOT (ms):                           630.59    
---------------Inter-token Latency----------------
Mean ITL (ms):                           369.69    
Median ITL (ms):                         481.72    
P99 ITL (ms):                            805.01    
==================================================

============ Serving Benchmark Result ============
Successful requests:                     16        
Benchmark duration (s):                  206.97    
Total input tokens:                      160000    
Total generated tokens:                  1923      
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         9.29      
Total Token throughput (tok/s):          782.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          105158.97 
Median TTFT (ms):                        105258.72 
P99 TTFT (ms):                           196528.90 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          512.55    
Median TPOT (ms):                        625.75    
P99 TPOT (ms):                           640.51    
---------------Inter-token Latency----------------
Mean ITL (ms):                           507.65    
Median ITL (ms):                         602.16    
P99 ITL (ms):                            903.33    
==================================================

============ Serving Benchmark Result ============
Successful requests:                     32        
Benchmark duration (s):                  402.15    
Total input tokens:                      320000    
Total generated tokens:                  3684      
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         9.16      
Total Token throughput (tok/s):          804.89    
---------------Time to First Token----------------
Mean TTFT (ms):                          202961.69 
Median TTFT (ms):                        203092.99 
P99 TTFT (ms):                           389607.62 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          563.16    
Median TPOT (ms):                        622.15    
P99 TPOT (ms):                           630.65    
---------------Inter-token Latency----------------
Mean ITL (ms):                           556.22    
Median ITL (ms):                         602.21    
P99 ITL (ms):                            805.55    
==================================================

============ Serving Benchmark Result ============
Successful requests:                     64        
Benchmark duration (s):                  792.10    
Total input tokens:                      640000    
Total generated tokens:                  7257      
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         9.16      
Total Token throughput (tok/s):          817.14    
---------------Time to First Token----------------
Mean TTFT (ms):                          399467.18 
Median TTFT (ms):                        400486.56 
P99 TTFT (ms):                           776547.49 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          588.74    
Median TPOT (ms):                        619.06    
P99 TPOT (ms):                           628.87    
---------------Inter-token Latency----------------
Mean ITL (ms):                           582.10    
Median ITL (ms):                         602.62    
P99 ITL (ms):                            835.49    
==================================================